vscorza/mununu/examples/industrial/codesign_nrf52_twim_i2c/upstream/nrfx_twim_buggy.c
#if NRF_ERRATA_STATIC_CHECK(52, 219) || NRF_ERRATA_STATIC_CHECK(53, 47)
    if ((NRF_ERRATA_DYNAMIC_CHECK(52, 219) || NRF_ERRATA_DYNAMIC_CHECK(53, 47)) &&
        (p_config->frequency == NRF_TWIM_FREQ_400K))
    {
        nrfy_config.frequency = (nrf_twim_frequency_t) 0x06200000UL; // 390 kbps
    }
#endif

    nrfy_twim_periph_configure(p_instance->p_twim, &nrfy_config);
    if (p_instance->cb.handler)
    {
        nrfy_twim_int_init(p_instance->p_twim, 0, p_config->interrupt_priority, false);
    }
}

static bool pins_configure(nrfx_twim_config_t const * p_config)
{
    nrf_gpio_pin_drive_t pin_drive;

    if (p_config->skip_psel_cfg && p_config->skip_gpio_cfg)
    {
        return true;
    }

#if NRF_TWIM_HAS_1000_KHZ_FREQ && defined(NRF_TWIM_1MBPS_NEEDS_E0E1)
    if (p_config->frequency >= NRF_TWIM_FREQ_1000K)
    {
        /* When using 1 Mbps mode, two high-speed pins have to be used with extra high drive. */
        pin_drive = NRF_GPIO_PIN_E0E1;

        uint32_t e0e1_pin_1 = NRF_GPIO_PIN_MAP(1, 2);
        uint32_t e0e1_pin_2 = NRF_GPIO_PIN_MAP(1, 3);

        /* Check whether provided pins have the extra high drive capabilities. */
        if (((p_config->scl_pin != e0e1_pin_1) ||
             (p_config->sda_pin != e0e1_pin_2)) &&
            ((p_config->scl_pin != e0e1_pin_2) ||
             (p_config->sda_pin != e0e1_pin_1)))
        {
            return false;
        }
    }
    else
#endif
    {
        pin_drive = NRF_GPIO_PIN_S0D1;
    }

    /* To secure correct signal levels on the pins used by the TWI
       master when the system is in OFF mode, and when the TWI master is
       disabled, these pins must be configured in the GPIO peripheral.
    */
   if (!p_config->skip_gpio_cfg)
   {
        NRFX_ASSERT(p_config->scl_pin != p_config->sda_pin);
        TWIM_PIN_INIT(p_config->scl_pin, pin_drive);
        TWIM_PIN_INIT(p_config->sda_pin, pin_drive);
#if NRF_GPIO_HAS_CLOCKPIN
#if defined(NRF_TWIM_CLOCKPIN_SCL_NEEDED)
        nrfy_gpio_pin_clock_set(p_config->scl_pin, true);
#endif
#if defined(NRF_TWIM_CLOCKPIN_SDA_NEEDED)
        nrfy_gpio_pin_clock_set(p_config->sda_pin, true);
#endif
#endif
   }
    return true;
}

int nrfx_twim_init(nrfx_twim_t *              p_instance,
                   nrfx_twim_config_t const * p_config,
                   nrfx_twim_event_handler_t    event_handler,
                   void *                     p_context)
{
    NRFX_ASSERT(p_instance && p_config);

    nrfx_twim_control_block_t * p_cb = &p_instance->cb;
    int err_code;

    if (p_cb->state != NRFX_DRV_STATE_UNINITIALIZED)
    {
        err_code = -EALREADY;
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }

#if NRFX_CHECK(NRFX_PRS_ENABLED)
    err_code = nrfx_prs_acquire(p_instance->p_twim,
                                (nrfx_irq_handler_t)nrfx_twim_irq_handler,p_instance);
    if (err_code < 0)
    {
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }
#endif // NRFX_CHECK(NRFX_PRS_ENABLED)

    p_cb->handler         = event_handler;
    p_cb->p_context       = p_context;
    p_cb->int_mask        = 0;
    p_cb->repeated        = false;
    p_cb->busy            = false;

    if (p_config)
    {
        p_cb->skip_gpio_cfg = p_config->skip_gpio_cfg;
        if (!pins_configure(p_config))
        {
#if NRFX_CHECK(NRFX_PRS_ENABLED)
            nrfx_prs_release(p_instance->p_twim);
#endif
            return -EINVAL;
        }

        p_cb->hold_bus_uninit = p_config->hold_bus_uninit;
#if NRF_ERRATA_STATIC_CHECK(52, 109)
        if (NRF_ERRATA_DYNAMIC_CHECK(52, 109))
        {
            p_cb->bus_frequency = (nrf_twim_frequency_t)p_config->frequency;
        }
#endif

        twim_configure(p_instance, p_config);
    }

    p_cb->state = NRFX_DRV_STATE_INITIALIZED;

    err_code = 0;
    NRFX_LOG_INFO("Function: %s, error code: %s.", __func__, NRFX_LOG_ERROR_STRING_GET(err_code));
    return err_code;
}

int nrfx_twim_reconfigure(nrfx_twim_t *              p_instance,
                          nrfx_twim_config_t const * p_config)
{
    NRFX_ASSERT(p_instance && p_config);

    nrfx_twim_control_block_t * p_cb = &p_instance->cb;

    if (p_cb->state == NRFX_DRV_STATE_UNINITIALIZED)
    {
        return -EINPROGRESS;
    }
    if (p_cb->busy)
    {
        return -EBUSY;
    }

    int err_code = 0;
    nrfy_twim_disable(p_instance->p_twim);
    if (pins_configure(p_config))
    {
        twim_configure(p_instance, p_config);
    }
    else
    {
        err_code = -EINVAL;
    }
    nrfy_twim_enable(p_instance->p_twim);
    return err_code;
}

void nrfx_twim_callback_get(nrfx_twim_t const *         p_instance,
                            nrfx_twim_event_handler_t * p_event_handler,
                            void **                     pp_context)
{
    NRFX_ASSERT(p_instance);

    nrfx_twim_control_block_t const * p_cb = &p_instance->cb;

    *p_event_handler = p_cb->handler;
    *pp_context      = p_cb->p_context;
}

int nrfx_twim_callback_set(nrfx_twim_t *             p_instance,
                           nrfx_twim_event_handler_t event_handler,
                           void *                    p_context)
{
    NRFX_ASSERT(p_instance && event_handler);

    nrfx_twim_control_block_t * p_cb = &p_instance->cb;

    if (p_cb->busy)
    {
        return -EBUSY;
    }

    if (p_cb->handler == NULL)
    {
        return -EINPROGRESS;
    }

    nrfy_twim_int_disable(p_instance->p_twim, NRF_TWIM_ALL_INTS_MASK);

    p_cb->handler   = event_handler;
    p_cb->p_context = p_context;

    return 0;
}

void nrfx_twim_uninit(nrfx_twim_t * p_instance)
{
    NRFX_ASSERT(p_instance);

    nrfx_twim_control_block_t * p_cb = &p_instance->cb;

    NRFX_ASSERT(p_cb->state != NRFX_DRV_STATE_UNINITIALIZED);

    nrfy_twim_int_uninit(p_instance->p_twim);
    nrfx_twim_disable(p_instance);

#if NRFX_CHECK(NRFX_PRS_ENABLED)
    nrfx_prs_release(p_instance->p_twim);
#endif

