vscorza/mununu/examples/industrial/codesign_nrf52_twim_i2c/upstream/nrfx_twim_buggy.c
    if (!p_cb->skip_gpio_cfg && !p_cb->hold_bus_uninit)
    {
        nrfy_twim_pins_t pins;

        nrfy_twim_pins_get(p_instance->p_twim, &pins);
        nrfy_gpio_cfg_default(pins.scl_pin);
        nrfy_gpio_cfg_default(pins.sda_pin);
    }

    p_cb->state = NRFX_DRV_STATE_UNINITIALIZED;
    NRFX_LOG_INFO("Instance uninitialized: %p.", p_instance->p_twim);
}

bool nrfx_twim_init_check(nrfx_twim_t const * p_instance)
{
    NRFX_ASSERT(p_instance);

    nrfx_twim_control_block_t const * p_cb = &p_instance->cb;

    return (p_cb->state != NRFX_DRV_STATE_UNINITIALIZED);
}

void nrfx_twim_enable(nrfx_twim_t * p_instance)
{
    NRFX_ASSERT(p_instance);

    nrfx_twim_control_block_t * p_cb = &p_instance->cb;
    NRFX_ASSERT(p_cb->state == NRFX_DRV_STATE_INITIALIZED);

    nrfy_twim_enable(p_instance->p_twim);

    p_cb->state = NRFX_DRV_STATE_POWERED_ON;
    NRFX_LOG_INFO("Instance enabled: %p.", p_instance->p_twim);
}

void nrfx_twim_disable(nrfx_twim_t * p_instance)
{
    NRFX_ASSERT(p_instance);

    nrfx_twim_control_block_t * p_cb = &p_instance->cb;

    NRFX_ASSERT(p_cb->state != NRFX_DRV_STATE_UNINITIALIZED);

    p_cb->int_mask = 0;
    nrfy_twim_stop(p_instance->p_twim);
    p_cb->state = NRFX_DRV_STATE_INITIALIZED;
    p_cb->busy = false;
    NRFX_LOG_INFO("Instance disabled: %p.", p_instance->p_twim);
}

bool nrfx_twim_is_busy(nrfx_twim_t * p_instance)
{
    NRFX_ASSERT(p_instance);

    nrfx_twim_control_block_t * p_cb = &p_instance->cb;
    return p_cb->busy;
}

static int twim_xfer(nrfx_twim_control_block_t   * p_cb,
                     NRF_TWIM_Type               * p_twim,
                     nrfx_twim_xfer_desc_t const * p_xfer_desc,
                     uint32_t                      flags)
{
    int err_code = 0;
    p_cb->error = false;

    if (p_xfer_desc->primary_length != 0 &&
        !nrf_dma_accessible_check(p_twim, p_xfer_desc->p_primary_buf))
    {
        err_code = -EACCES;
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }

    if ((p_xfer_desc->type == NRFX_TWIM_XFER_TXTX ||
         p_xfer_desc->type == NRFX_TWIM_XFER_TXRX) &&
         !nrf_dma_accessible_check(p_twim, p_xfer_desc->p_secondary_buf))
    {
            err_code = -EACCES;
            NRFX_LOG_WARNING("Function: %s, error code: %s.",
                             __func__,
                             NRFX_LOG_ERROR_STRING_GET(err_code));
            return err_code;
    }

#if !NRFY_TWIM_HAS_ARRAY_LIST
    if ((NRFX_TWIM_FLAG_TX_POSTINC | NRFX_TWIM_FLAG_RX_POSTINC) & flags)
    {
        err_code = -ENOTSUP;
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }
#endif

    /* Block TWI interrupts to ensure that function is not interrupted by TWI interrupt. */
    nrfy_twim_int_disable(p_twim, NRF_TWIM_ALL_INTS_MASK);
    if (p_cb->busy)
    {
        nrfy_twim_int_enable(p_twim, p_cb->int_mask);
        err_code = -EBUSY;
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }
    else
    {
        p_cb->busy = ((NRFX_TWIM_FLAG_NO_XFER_EVT_HANDLER & flags) ||
                      (NRFX_TWIM_FLAG_REPEATED_XFER & flags)) ? false : true;
    }

    p_cb->xfer_type = p_xfer_desc->type;
    p_cb->address   = p_xfer_desc->address;
    p_cb->xfer_desc_primary.p_buffer   = p_xfer_desc->p_primary_buf;
    p_cb->xfer_desc_primary.length     = p_xfer_desc->primary_length;
    p_cb->xfer_desc_secondary.p_buffer = p_xfer_desc->p_secondary_buf;
    p_cb->xfer_desc_secondary.length   = p_xfer_desc->secondary_length;
    p_cb->repeated = (flags & NRFX_TWIM_FLAG_REPEATED_XFER) ? true : false;
    p_cb->flags = flags;
    nrfy_twim_address_set(p_twim, p_xfer_desc->address);

    nrfy_twim_event_clear(p_twim, NRF_TWIM_EVENT_LASTTX);
    nrfy_twim_event_clear(p_twim, NRF_TWIM_EVENT_SUSPENDED);
    nrfy_twim_event_clear(p_twim, NRF_TWIM_EVENT_ERROR);
    nrfy_twim_event_clear(p_twim, NRF_TWIM_EVENT_STOPPED);

#if NRFY_TWIM_HAS_ARRAY_LIST
    nrfy_twim_tx_list_set(p_twim, NRFX_TWIM_FLAG_TX_POSTINC & flags);
    nrfy_twim_rx_list_set(p_twim, NRFX_TWIM_FLAG_RX_POSTINC & flags);
#endif
    switch (p_xfer_desc->type)
    {
        case NRFX_TWIM_XFER_TXTX:
            NRFX_ASSERT(!(flags & NRFX_TWIM_FLAG_REPEATED_XFER) &&
                        !(flags & NRFX_TWIM_FLAG_HOLD_XFER) &&
                        !(flags & NRFX_TWIM_FLAG_NO_XFER_EVT_HANDLER));
            nrfy_twim_shorts_set(p_twim, NRF_TWIM_SHORT_LASTTX_SUSPEND_MASK);
            nrfy_twim_tx_buffer_set(p_twim, &p_cb->xfer_desc_primary);
            nrfy_twim_tx_start(p_twim, NULL);
            while (nrfy_twim_events_process(p_twim,
                                            NRFY_EVENT_TO_INT_BITMASK(NRF_TWIM_EVENT_TXSTARTED),
                                            NULL))
            {}
            nrfy_twim_tx_buffer_set(p_twim, &p_cb->xfer_desc_secondary);
            NRFX_LOG_DEBUG("TWIM: Event: %s.", EVT_TO_STR_TWIM(NRF_TWIM_EVENT_TXSTARTED));
            p_cb->int_mask = NRF_TWIM_INT_SUSPENDED_MASK;
            break;
        case NRFX_TWIM_XFER_TXRX:
            /* PLANTED BUG — Claims Integrity Rule 2: this is a deliberately
             * introduced demonstration bug for the codesign flagship. It is
             * NOT a real bug in nrfx; the upstream nrfx_twim.c correctly
             * orders the buffer-set before TASKS_RESUME (see
             * upstream/nrfx_twim.c:534-541 for the canonical sequence).
             * The pattern is anchored against the public errata pedigree
             * for nRF52 silicon, e.g. Nordic Errata 211 on TWIM
             * frequency-change ordering and the broader register-write-
             * ordering family. The bug here is: TASKS_RESUME (the task
             * trigger that arms EasyDMA) is issued BEFORE the TXD/RXD
             * pointer writes, so on real silicon the EasyDMA prefetch
             * could race the pointer update and use a stale or
             * uninitialised buffer address. */
            nrfy_twim_task_trigger(p_twim, NRF_TWIM_TASK_RESUME);   /* TASK fires FIRST — buggy ordering */
            nrfy_twim_tx_buffer_set(p_twim, &p_cb->xfer_desc_primary);
            nrfy_twim_rx_buffer_set(p_twim, &p_cb->xfer_desc_secondary);
            nrfy_twim_shorts_set(p_twim, NRF_TWIM_SHORT_LASTTX_STARTRX_MASK |
                                    NRF_TWIM_SHORT_LASTRX_STOP_MASK);
            p_cb->int_mask = NRF_TWIM_INT_STOPPED_MASK;
            break;
        case NRFX_TWIM_XFER_TX:
            nrfy_twim_tx_buffer_set(p_twim, &p_cb->xfer_desc_primary);
            if (NRFX_TWIM_FLAG_TX_NO_STOP & flags)
            {
                nrfy_twim_shorts_set(p_twim, NRF_TWIM_SHORT_LASTTX_SUSPEND_MASK);
                p_cb->int_mask = NRF_TWIM_INT_SUSPENDED_MASK;
            }
            else
            {
                nrfy_twim_shorts_set(p_twim, NRF_TWIM_SHORT_LASTTX_STOP_MASK);
                p_cb->int_mask = NRF_TWIM_INT_STOPPED_MASK;
            }
            nrfy_twim_task_trigger(p_twim, NRF_TWIM_TASK_RESUME);
            break;
        case NRFX_TWIM_XFER_RX:
            nrfy_twim_rx_buffer_set(p_twim, &p_cb->xfer_desc_primary);
            nrfy_twim_shorts_set(p_twim, NRF_TWIM_SHORT_LASTRX_STOP_MASK);
            nrfy_twim_task_trigger(p_twim, NRF_TWIM_TASK_RESUME);
            p_cb->int_mask = NRF_TWIM_INT_STOPPED_MASK;
            break;
        default:
            err_code = -EINVAL;
            break;
    }

