vscorza/mununu/examples/industrial/codesign_nrf52_twim_i2c/upstream/nrfx_twim_buggy.c
    if (!(flags & NRFX_TWIM_FLAG_HOLD_XFER) && (p_xfer_desc->type != NRFX_TWIM_XFER_TXTX))
    {
        if (p_xfer_desc->type == NRFX_TWIM_XFER_RX)
        {
            nrfy_twim_rx_start(p_twim, p_cb->handler ? NULL : &p_cb->xfer_desc_primary);
        }
        else
        {
            nrfy_twim_tx_start(p_twim, p_cb->handler ? NULL : &p_cb->xfer_desc_primary);
        }
        /* Handling zero length transfers in non-blocking mode.
           In blocking mode zero length transfer is handled in
           @ref{nrfy_twim_tx_start} and @ref{nrfy_twim_rx_start}
        */
        if (p_xfer_desc->primary_length == 0 && p_cb->handler)
        {
            nrfy_twim_task_trigger(p_twim, NRF_TWIM_TASK_STOP);
        }
    }

    if (p_cb->handler)
    {
        if (flags & NRFX_TWIM_FLAG_NO_XFER_EVT_HANDLER)
        {
            p_cb->int_mask = 0;
        }

        if (!(flags & NRFX_TWIM_FLAG_NO_SPURIOUS_STOP_CHECK))
        {
            p_cb->int_mask |= NRF_TWIM_INT_STOPPED_MASK;
        }

        // Interrupts for ERROR are implicitly enabled, regardless of driver configuration.
        p_cb->int_mask |= NRF_TWIM_INT_ERROR_MASK;
        nrfy_twim_int_enable(p_twim, p_cb->int_mask);

#if NRF_ERRATA_STATIC_CHECK(52, 109)
        if (NRF_ERRATA_DYNAMIC_CHECK(52, 109))
        {
            if ((flags & NRFX_TWIM_FLAG_HOLD_XFER) && (p_xfer_desc->type != NRFX_TWIM_XFER_RX))
            {
                nrfy_twim_tx_list_set(p_twim, false);
                nrfy_twim_rx_list_set(p_twim, false);
                p_twim->FREQUENCY = 0;
                nrfy_twim_event_clear(p_twim, NRF_TWIM_EVENT_TXSTARTED);
                nrfy_twim_int_enable(p_twim, NRF_TWIM_INT_TXSTARTED_MASK);
            }
            else
            {
                nrf_twim_frequency_t new_frequency = p_cb->bus_frequency;
#if NRF_ERRATA_STATIC_CHECK(52, 219) || NRF_ERRATA_STATIC_CHECK(53, 47)
                if ((NRF_ERRATA_DYNAMIC_CHECK(52, 219) || NRF_ERRATA_DYNAMIC_CHECK(53, 47)) &&
                    (p_cb->bus_frequency == NRF_TWIM_FREQ_400K))
                {
                    new_frequency = (nrf_twim_frequency_t) 0x06200000UL; // 390 kbps
                }
#endif
                nrfy_twim_frequency_set(p_twim, new_frequency);
            }
        }
#endif
    }
    else
    {
        uint32_t errorsrc = nrfy_twim_errorsrc_get_and_clear(p_twim);

        p_cb->busy = false;

        if (errorsrc)
        {
            err_code = twi_process_error(errorsrc);
        }
        else
        {
            if (!(flags & NRFX_TWIM_FLAG_NO_SPURIOUS_STOP_CHECK) &&
                !xfer_completeness_check(p_twim, p_cb))
            {
                err_code = -ECANCELED;
            }
        }
    }

    NRFX_LOG_INFO("Function: %s, error code: %s.",
                  __func__,
                  NRFX_LOG_ERROR_STRING_GET(err_code));
    return err_code;
}


int nrfx_twim_xfer(nrfx_twim_t                 * p_instance,
                   nrfx_twim_xfer_desc_t const * p_xfer_desc,
                   uint32_t                      flags)
{
    NRFX_ASSERT(p_instance);

    nrfx_twim_control_block_t * p_cb = &p_instance->cb;

    NRFX_ASSERT(p_cb->state == NRFX_DRV_STATE_POWERED_ON);

    // TXRX and TXTX transfers are supported only in non-blocking mode.
    NRFX_ASSERT(!((p_cb->handler == NULL) &&
                  ((p_xfer_desc->type == NRFX_TWIM_XFER_TXRX) ||
                   (p_xfer_desc->type == NRFX_TWIM_XFER_TXTX))));

    NRFX_LOG_INFO("Transfer type: %s.", TRANSFER_TO_STR(p_xfer_desc->type));
    NRFX_LOG_INFO("Transfer buffers length: primary: %d, secondary: %d.",
                  p_xfer_desc->primary_length,
                  p_xfer_desc->secondary_length);
    NRFX_LOG_DEBUG("Primary buffer data:");
    NRFX_LOG_HEXDUMP_DEBUG(p_xfer_desc->p_primary_buf,
                           p_xfer_desc->primary_length *
                           sizeof(p_xfer_desc->p_primary_buf[0]));
    NRFX_LOG_DEBUG("Secondary buffer data:");
    NRFX_LOG_HEXDUMP_DEBUG(p_xfer_desc->p_secondary_buf,
                           p_xfer_desc->secondary_length *
                           sizeof(p_xfer_desc->p_secondary_buf[0]));

    return twim_xfer(p_cb, p_instance->p_twim, p_xfer_desc, flags);
}

uint32_t nrfx_twim_start_task_address_get(nrfx_twim_t const *   p_instance,
                                          nrfx_twim_xfer_type_t xfer_type)
{
    NRFX_ASSERT(p_instance && (p_instance->cb.state != NRFX_DRV_STATE_UNINITIALIZED));

    return nrfy_twim_task_address_get(p_instance->p_twim,
        (xfer_type != NRFX_TWIM_XFER_RX) ? NRF_TWIM_TASK_STARTTX : NRF_TWIM_TASK_STARTRX);
}

uint32_t nrfx_twim_stopped_event_address_get(nrfx_twim_t const * p_instance)
{
    NRFX_ASSERT(p_instance && (p_instance->cb.state != NRFX_DRV_STATE_UNINITIALIZED));

    return nrfy_twim_event_address_get(p_instance->p_twim, NRF_TWIM_EVENT_STOPPED);
}

void nrfx_twim_irq_handler(nrfx_twim_t * p_instance)
{
    NRFX_ASSERT(p_instance);

    NRF_TWIM_Type * p_twim = p_instance->p_twim;
    nrfx_twim_control_block_t * p_cb = &p_instance->cb;

    nrfy_twim_xfer_desc_t * p_xfer = p_cb->xfer_type == NRFX_TWIM_XFER_RX ?
                                                        &p_cb->xfer_desc_primary :
                                                        &p_cb->xfer_desc_secondary;
#if NRF_ERRATA_STATIC_CHECK(52, 109)
    if (NRF_ERRATA_DYNAMIC_CHECK(52, 109) &&
        nrfy_twim_events_process(p_twim,
                                 NRFY_EVENT_TO_INT_BITMASK(NRF_TWIM_EVENT_TXSTARTED),
                                 NULL))
    {
        nrfy_twim_int_disable(p_twim, NRF_TWIM_INT_TXSTARTED_MASK);
        if (p_twim->FREQUENCY == 0)
        {
            // Set enable to zero to reset TWIM internal state.
            nrfy_twim_disable(p_twim);
            nrfy_twim_enable(p_twim);

            // Set proper frequency.
#if NRF_ERRATA_STATIC_CHECK(52, 219) || NRF_ERRATA_STATIC_CHECK(53, 47)
            if ((NRF_ERRATA_DYNAMIC_CHECK(52, 219) || NRF_ERRATA_DYNAMIC_CHECK(53, 47)) &&
                (p_cb->bus_frequency == NRF_TWIM_FREQ_400K))
            {
                nrfy_twim_frequency_set(p_twim, (nrf_twim_frequency_t) 0x06200000UL); // 390 kbps
            }
            else
#endif
            {
                nrfy_twim_frequency_set(p_twim, p_cb->bus_frequency);
            }
            nrfy_twim_tx_list_set(p_twim, NRFX_TWIM_FLAG_TX_POSTINC & p_cb->flags);
            nrfy_twim_rx_list_set(p_twim, NRFX_TWIM_FLAG_RX_POSTINC & p_cb->flags);
            // Start proper transmission.
            nrfy_twim_task_trigger(p_twim, NRF_TWIM_TASK_STARTTX);
            return;
        }
    }
#endif
    NRFX_ASSERT(p_cb->handler);

    bool stopped = nrfy_twim_events_process(p_twim,
                                            NRFY_EVENT_TO_INT_BITMASK(NRF_TWIM_EVENT_STOPPED),
                                            p_xfer);

