vscorza/mununu/examples/industrial/codesign_nrf52_twim_i2c/upstream/nrfx_twim_buggy.c
    if (nrfy_twim_events_process(p_twim,
                                 NRFY_EVENT_TO_INT_BITMASK(NRF_TWIM_EVENT_ERROR),
                                 p_xfer))
    {
        NRFX_LOG_DEBUG("TWIM: Event: %s.", EVT_TO_STR_TWIM(NRF_TWIM_EVENT_ERROR));
        if (!stopped)
        {
            nrfy_twim_int_disable(p_twim, p_cb->int_mask);
            p_cb->int_mask = NRF_TWIM_INT_STOPPED_MASK;
            nrfy_twim_int_enable(p_twim, p_cb->int_mask);

            if (!(nrfy_twim_events_process(p_twim,
                                           NRFY_EVENT_TO_INT_BITMASK(NRF_TWIM_EVENT_LASTTX),
                                           NULL) &&
                 (nrfy_twim_shorts_get(p_twim) & NRF_TWIM_SHORT_LASTTX_STOP_MASK)))
            {
                nrfy_twim_task_trigger(p_twim, NRF_TWIM_TASK_RESUME);
                nrfy_twim_task_trigger(p_twim, NRF_TWIM_TASK_STOP);
            }

            p_cb->error = true;
            return;
        }
    }

    nrfx_twim_event_t event;

    if (stopped)
    {
        NRFX_LOG_DEBUG("TWIM: Event: %s.", EVT_TO_STR_TWIM(NRF_TWIM_EVENT_STOPPED));

        if (!(p_cb->flags & NRFX_TWIM_FLAG_NO_SPURIOUS_STOP_CHECK) && !p_cb->error)
        {
            p_cb->error = !xfer_completeness_check(p_twim, p_cb);
        }

        // Further processing of STOPPED event is valid only if NO_XFER_EVT_HANDLER
        // setting is not used.
        if (!(p_cb->flags & NRFX_TWIM_FLAG_NO_XFER_EVT_HANDLER))
        {
            nrfy_twim_event_clear(p_twim, NRF_TWIM_EVENT_LASTTX);
            nrfy_twim_event_clear(p_twim, NRF_TWIM_EVENT_LASTRX);
            if (!p_cb->repeated || p_cb->error)
            {
                nrfy_twim_shorts_set(p_twim, 0);
                p_cb->int_mask = 0;
                nrfy_twim_int_disable(p_twim, NRF_TWIM_ALL_INTS_MASK);

                // At this point interrupt handler should not be invoked again for current transfer.
                // If STOPPED arrived during ERROR processing,
                // its pending interrupt should be ignored.
                // Otherwise spurious NRFX_TWIM_EVT_DONE or NRFX_TWIM_EVT_BUS_ERROR
                // would be passed to user's handler.
                NRFY_IRQ_PENDING_CLEAR(nrfx_get_irq_number(p_twim));
            }

            event.xfer_desc.type    = p_cb->xfer_type;
            event.xfer_desc.address = p_cb->address;
            event.xfer_desc.p_primary_buf    = p_cb->xfer_desc_primary.p_buffer;
            event.xfer_desc.primary_length   = p_cb->xfer_desc_primary.length;
            event.xfer_desc.p_secondary_buf  = p_cb->xfer_desc_secondary.p_buffer;
            event.xfer_desc.secondary_length = p_cb->xfer_desc_secondary.length;
        }
#if NRF_ERRATA_STATIC_CHECK(52, 109)
        else if (NRF_ERRATA_DYNAMIC_CHECK(52, 109) && (p_cb->xfer_type != NRFX_TWIM_XFER_RX))
        {
            /* Add Anomaly 109 workaround for each potential repeated transfer starting from TX. */
            nrfy_twim_tx_list_set(p_twim, false);
            nrfy_twim_rx_list_set(p_twim, false);
            nrfy_twim_frequency_set(p_twim, (nrf_twim_frequency_t)0);
            nrfy_twim_int_enable(p_twim, NRF_TWIM_INT_TXSTARTED_MASK);
        }
#endif
    }
    else
    {
        (void)nrfy_twim_events_process(p_twim,
                                       NRFY_EVENT_TO_INT_BITMASK(NRF_TWIM_EVENT_SUSPENDED),
                                       p_xfer);
        NRFX_LOG_DEBUG("TWIM: Event: %s.", EVT_TO_STR_TWIM(NRF_TWIM_EVENT_SUSPENDED));
        if (p_cb->xfer_type == NRFX_TWIM_XFER_TX)
        {
            if (!p_cb->repeated)
            {
                nrfy_twim_shorts_set(p_twim, 0);
                p_cb->int_mask = 0;
                nrfy_twim_int_disable(p_twim, NRF_TWIM_ALL_INTS_MASK);

                // At this point interrupt handler should not be invoked again for current transfer.
                // If STOPPED arrived during SUSPENDED processing,
                // its pending interrupt should be ignored.
                // Otherwise spurious NRFX_TWIM_EVT_DONE or NRFX_TWIM_EVT_BUS_ERROR
                // would be passed to user's handler.
                NRFY_IRQ_PENDING_CLEAR(nrfx_get_irq_number(p_twim));
            }

            event.xfer_desc.type    = p_cb->xfer_type;
            event.xfer_desc.address = p_cb->address;
            event.xfer_desc.p_primary_buf    = p_cb->xfer_desc_primary.p_buffer;
            event.xfer_desc.primary_length   = p_cb->xfer_desc_primary.length;
            event.xfer_desc.p_secondary_buf  = p_cb->xfer_desc_secondary.p_buffer;
            event.xfer_desc.secondary_length = p_cb->xfer_desc_secondary.length;
        }
        else
        {
            nrfy_twim_shorts_set(p_twim, NRF_TWIM_SHORT_LASTTX_STOP_MASK);
            p_cb->int_mask = NRF_TWIM_INT_STOPPED_MASK | NRF_TWIM_INT_ERROR_MASK;
            nrfy_twim_int_disable(p_twim, NRF_TWIM_ALL_INTS_MASK);
            nrfy_twim_int_enable(p_twim, p_cb->int_mask);
            nrfy_twim_task_trigger(p_twim, NRF_TWIM_TASK_STARTTX);
            nrfy_twim_task_trigger(p_twim, NRF_TWIM_TASK_RESUME);
            return;
        }
    }

    uint32_t errorsrc = nrfy_twim_errorsrc_get_and_clear(p_twim);
    if (errorsrc & NRF_TWIM_ERROR_ADDRESS_NACK)
    {
        event.type = NRFX_TWIM_EVT_ADDRESS_NACK;
        NRFX_LOG_DEBUG("Event: %s.", EVT_TO_STR(NRFX_TWIM_EVT_ADDRESS_NACK));
    }
    else if (errorsrc & NRF_TWIM_ERROR_DATA_NACK)
    {
        event.type = NRFX_TWIM_EVT_DATA_NACK;
        NRFX_LOG_DEBUG("Event: %s.", EVT_TO_STR(NRFX_TWIM_EVT_DATA_NACK));
    }
    else if (errorsrc & NRF_TWIM_ERROR_OVERRUN)
    {
        event.type = NRFX_TWIM_EVT_OVERRUN;
        NRFX_LOG_DEBUG("Event: %s.", EVT_TO_STR(NRFX_TWIM_EVT_OVERRUN));
    }
    else if (p_cb->error)
    {
        event.type = NRFX_TWIM_EVT_BUS_ERROR;
        NRFX_LOG_DEBUG("Event: %s.", EVT_TO_STR(NRFX_TWIM_EVT_BUS_ERROR));
    }
    else
    {
        event.type = NRFX_TWIM_EVT_DONE;
        NRFX_LOG_DEBUG("Event: %s.", EVT_TO_STR(NRFX_TWIM_EVT_DONE));
    }

    if (!p_cb->repeated)
    {
        p_cb->busy = false;
    }

    if (!(p_cb->flags & NRFX_TWIM_FLAG_NO_XFER_EVT_HANDLER) || p_cb->error)
    {
        p_cb->handler(&event, p_cb->p_context);
    }
}
